#define _CRT_SECURE_NO_WARNINGS 1;
#include <stdio.h>
#include <string.h>

//int short char  limits.h定义整型家族的取值范围
//float double    float.h 定义浮点型家族的取值范围
//#include <limits.h>
//#include <float.h>
//int main(void) {
//	//整型
//	INT_MAX;  //转倒定义
//
//	//浮点型  DIG  精度
//	FLT_MAX;
//	DBL_MAX;
//	return 0;
//}

//常见的浮点数
//3.1415926
//1E10 1的10次方  1E5  1的5次方

///将浮点数放入
/*
0.5
二进制 = 0.1  -> 1.0 *2^(-1)    M表示有效数字，大于等于1，小于2。
		s = 0   M = 0  E =-1+127
		0  01111110 0000000000000000000000000
		s	E			M	
		E-127  => -1
		M   => 0  =>加 1  => 1.0 * 2^(-1) =>  0.1(二进制) => 0.5(十进制)


	(-1)^S * M * 2^E
	(-1)^s表示符号位，当s=0，V为正数；当s=1，V为负数。
	M表示有效数字，大于等于1，小于2。
	2^E表示指数位。
		F：E+127
		D：E+1023

	float：4B
	所部分所占位数：S(1b)E(8b)M(23b)

	double：8B
	所部分所占位数：S(1b)E(11b)M(52b)
*/

///将浮点数取出（存入相反）  根据E分为三种情况
/*
	//1 E不全为0或不全为1
		第一步 E= E-127 （E-1023）
		第二部 将M取出  加1  第一位（最前）
	//2 E全为0
		浮点数1-127 （1-1023）即为真实值；  
		有效数字M不在加上第一位1；还原为 0.xxxx的小数；
		表示是一个接近于0的很小的数字
	//3 E全为1
		有效数M全为0；表示 ±无穷大 （取决于符号位 s）
*/
//int main(void) {
//	//浮点型 存储与内存中：
//	float f = 5.5f;    // 1:(2^2) 0:(2^1) 1:(2^0). 1:(2^-1) == 1/2 == 0.5 
//	//101.1 = 1.011 * 2^2
//	//符号位		s=0
//	//换算后小数点数据		M=1.011
//	//E=2 
//	// s=0  M=1.011  E=2
//	// s=0  M=011    E=2+127    (F+127 ; D+1023)
//	// S(1b)E(8b)M(23b)
//	//  
//	//十六进制显示
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//   40  b0 00 00 
//
//
//	int n = 9;  //4B
//	//0000 0000 0000 0000 0000 0000 0000 1001
//	// E为全零的情况！
//	// 0  00000000  00000000000000000001001
//	// s  E=（1-127）           M
//	// 0    E=—126  0.00000000000000000001001 * 2^-126  =>趋近于0的小数
//
//
//	int n2 = 5;
//	//0000 0000 0000 0000 0000 0000 0000 0101
//	//0 00000000 00000000000000000000101
//	// s = 0  
//	// E = 0(全零) =>  1-127 = -126 
//	// M = 0.00000000000000000000101  （0.xxxxxx的形式）
//	// ret = M * 2^（-126）  => 趋近于0
//
//
//
//	float* pFloat = (float*)&n;
//	float* pFloat2 = (float*)&n2;
//	printf("n=%d\n", n);
//	printf("pFloat=%f\n", *pFloat);  //0.00000000000=>趋近于0的小数
//	printf("pFloat2=%f\n", *pFloat2);  //
//
//	*pFloat = 9.0;
//	//0000 1001.0
//	//s = 0
//	//M = 1.001 * 2^(3)  M = 001
//	//E = 3+127 =130
//	// s  E        M
//	// 0 10000010 00100000000000000000000   (内存的形式)
//	
//	// %d（十进制打印） 01000001000100000000000000000000(原反补) => 1,091,567,616
//	printf("n=%d\n", n);
//	printf("pFloat=%f\n", *pFloat);
//	return 0;
//}